import Sensor
import Value

if Sensor.sensor.Amount>Value.container.Amount:
                    print("보일러급수모드 사용 가능합니다.")
                    if input("빗물을 배관으로 보내겠습니까? Y or N : ")=="Y"or"y":
                        print("잠시 후 빗물배관의 밸브가 열립니다.")
                        belb_rain=1
                        print("-----------------------------------------------------------------------------")
                        print("예상 시간 :", Value.plumbing.t/60,"분")
                        print("-----------------------------------------------------------------------------")
                        print("정상모드로 돌아갑니다.")
                        print("-----------------------------------------------------------------------------")
else:            
    print("-----------------------------------------------------------------------------")
    print("빗물용수 공급이 필요합니다. 빗물양 : ", Sensor.sensor.Amount)
    print("정상모드로 돌아갑니다.")