import Sensor
import Value

Mode=input("모드를 이용하시겠습니까? Y or N : ")
if Mode=="Y" or "y":
    while True:
        print("-----------------------------------------------------------------------------")
        Mode = input("1 : 강수량 확인모드, 2 : 폐열회수모드 , 3 : 보일러급수모드, 4 : 정상운전모드")
        print("-----------------------------------------------------------------------------")
        if Mode=="1":
            #강수량 데이터 불러오기
            from mode_rain import result2, result
        
        elif Mode=="2":
            from mode_Heat import *

        elif Mode=="3":
            from mode_move import *
         
        else:
            print("정상운전모드로 작동합니다.") 
            print("-----------------------------------------------------------------------------")
            break
else :
    print("정상운전모드로 작동합니다.")
    print("-----------------------------------------------------------------------------")